---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintZ
source: html/42dc03a4-9d93-2acb-10d2-71357ebbf97e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintZ Property

"Z Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintZ { get; }
```